Repository: euroklicenka/euroklicenka
Catalog: lib/l10n/app_*.arb
Languages: cs, sk

# appTitle
source: Eurokeyring
cs: Euroklíčenka
sk: Eurokľúčenka

# mapAppBarTitle
source: Map of nearest places
cs: Mapa nejbližších míst
sk: Mapa najbližších miest

# listAppBarTitle
source: List of nearest places
cs: Seznam nejbližších míst
sk: Zoznam najbližších miest

# settingsAppBarTitle
source: Settings
cs: Nastavení
sk: Nastavenia

# mapLabel
source: Map
cs: Mapa
sk: Mapa

# listLabel
source: List
cs: Seznam
sk: Zoznam

# settingsLabel
source: Settings
cs: Nastavení
sk: Nastavenia

# generalSectionLabel
source: General
cs: Obecné
sk: Všeobecné

# languageSettingsTileLabel
source: Language
cs: Jazyk
sk: Jazyk

# darkModeSettingsTileLabel
source: Dark mode
cs: Tmavý režim
sk: Tmavý režim

# dateOfUpdate
source: Date of last database update
cs: Datum poslední aktualizace databáze
sk: Dátum poslednej aktualizácie databázy

# applicationLabel
source: Application
cs: Aplikace
sk: Aplikácie

# applicationGuideLabel
source: Application guide
cs: Průvodce aplikací
sk: Sprievodca aplikáciou

# aboutApplicationLabel
source: About application
cs: O aplikaci
sk: O aplikácii

# dataSourceLabel
source: Data source
cs: Zdroj dat
sk: Zdroj dát

# languagesLabel
source: Language settings
cs: Nastavení jazyka
sk: Nastavenia jazyka

# choiceOfLanguage
source: Select the language you want
cs: Vyberte požadovaný jazyk
sk: Vyberte požadovaný jazyk

# eurokeyLabel
source: Eurokeyring
cs: Euroklíčenka
sk: Eurokľúčenka

# welcomeGuidLabel
source: Welcome to Eurokeyring
cs: Vítejte v Euroklíčence
sk: Vitajte v Eurokľúčence

# body1GuidLabel
source: Thanks to this app, you can find all Euro-framed social facilities in the Czech Republic
cs: Díky této aplikace máte možnost najít v České republice všechna eurozámkem osazená sociální zařízení.
sk: Vďaka tejto aplikácii nájdete všetky sociálne zariadenia v Českej republike, ktoré majú európsky rámec.

# whatIsEurokeyringGuidLabel
source: What is a Euroframe?
cs: Co je to eurozámek?
sk: Čo je to eurorámec?

# mapTitleGuid
source: MAP
cs: MAPA
sk: MAPA

# body2GuidLabel
source: When you launch the app, a map of the immediate area will be displayed, showing the locations for the EuroKey.
cs: Po spuštění aplikace se zobrazí mapa nejbližšího okolí, na němž jsou vyznačena místa pro Euroklíč.
sk: Po spustení aplikácie sa zobrazí mapa najbližšieho okolia, na ktorej sú vyznačené miesta, kde sa nachádza kľúč Euroklúč.

# infoGuidLabel
source: INFORMATION ABOUT THE PLACE
cs: INFORMACE O MÍSTĚ
sk: INFORMÁCIE O MIESTE

# body3GuidLabel
source: When you click on one of the points, an information window appears with the option to navigate to that location.
cs: Po kliknutí na jeden z bodů se zobrazí informační okno s možností navigovat k danému místu.
sk: Po kliknutí na jeden z bodov sa zobrazí informačné okno s možnosťou navigácie na dané miesto.

# nearplacesGuidTitle
source: NEAREST PLACES
cs: NEJBLIŽŠÍ MÍSTA
sk: NAJBLIŽŠIE MIESTA

# body4GuidLabel
source: The location list shows the nearest locations to the user's current location. Select an item to display it on the map.
cs: Na listě lokací se zobrazují nejbližší místa k aktuální poloze uživatele. Volbou položky dojde k jejímu zobrazení na mapě.
sk: V zozname lokalít sa zobrazujú najbližšie lokality k aktuálnej polohe používateľa. Výberom položky ju zobrazíte na mape.

# startLabel
source: Start
cs: Začít
sk: Štart

# skipLabel
source: Skip
cs: Přeskočit
sk: Prejsť

# refreshLocationsMessage
source: refresh the list of locations
cs: Obnovit seznam míst
sk: Obnovenie zoznamu miest

# refreshDatabaseMessage
source: Restoring the database
cs: Obnovování databáze
sk: Obnovovanie databázy

# leadingText1
source: Eurokeyring is the property of the Faculty of Science
cs: EuroKlíčenka je majetkem Přírodovědecké fakulty
sk: Eurokľúčenka je majetkom Prírodovedeckej fakulty

# hyperText1
source: University of Ostrava
cs: Ostravské univerzity
sk: Ostravské univerzity

# trailingText1a
source: in
cs: v
sk: v

# trailingText1b
source: Ostrava
cs: Ostravě
sk: Ostrave

# leadingText2
source: The development of the new application was carried out by a team of students from
cs: Vývoj nové aplikace provedl tým studentů z
sk: Na vývoji novej aplikácie sa podieľal tím študentov z

# hyperText2
source: Department of Computer Science and Computers
cs: katedry informatiky a počítačů
sk: Katedra informatiky a počítačov

# trailingText2a
source: OU, which includes Barbora Hajíčková and
cs: OU, do kterého patří Barbora Hajíčková a
sk: OU, v ktorej pôsobia Barbora Hajíčková a

# trailingText2b
source: Ondřej Surý. The development of the original application was done by Jan Sonnek, Jan Kunetka and
cs: Ondřej Surý. Vývoj původní aplikace provedl Jan Sonnek, Jan Kunetka a
sk: Ondřej Surý. Na vývoji pôvodnej aplikácie sa podieľali Jan Sonnek, Jan Kunetka a

# leadingText3
source: Data on the location of the Euroframes are publicly available at
cs: Data o umístění eurozámků jsou veřejně dostupná na
sk: Údaje o umiestnení eurorámcov sú verejne dostupné na

# hyperText3
source: oficiálna webová stránka spoločnosti EuroKey
cs: oficiálních stránkách Euroklíče
sk: oficiálnej webovej stránke Eurokľúče

# copyrightLabel
source: Copyright © University of Ostrava
cs: Copyright © Ostravská univerzita
sk: Copyright © Ostravská univerzita

# uploadingdataMessage
source: Uploading data
cs: Nahrávám data
sk: Nahrávanie dát

# systemLanguage
source: System
sk: Systémový

# navigateButton
source: NAVIGATE
sk: Naviguj

# disabledLocationServicesMessage
source: Location services are disabled.
sk: Služby určovania polohy sú vypnuté.

# deniedLocationServicesMessage
source: Location permissions are denied.
sk: Oprávnenia na umiestnenie sú zamietnuté.

# permanentlyDeniedLocationServicesMessage
source: Location permissions are permanently denied, we cannot request permissions.
sk: Oprávnenia na umiestnenie sú trvalo zamietnuté, nemôžeme požiadať o oprávnenia.

source: Cannot open {url}.
sk: Nie je možné otvoriť adresu {url}.

# systemMode
source: Use system settings
sk: Podľa systému

source: Dark Mode
sk: Tmavý

source: Light Mode
sk: Svetlý

# modesLabel
source: Dark Mode settings
sk: Nastavenia tmavého režimu
